'''
기능개발
문제 설명
프로그래머스 팀에서는 기능 개선 작업을 수행 중입니다. 각 기능은 진도가 100%일 때 서비스에 반영할 수 있습니다.

또, 각 기능의 개발속도는 모두 다르기 때문에 뒤에 있는 기능이 앞에 있는 기능보다 먼저 개발될 수 있고, 이때 뒤에 있는 기능은 앞에 있는 기능이 배포될 때 함께 배포됩니다.

먼저 배포되어야 하는 순서대로 작업의 진도가 적힌 정수 배열 progresses와 각 작업의 개발 속도가 적힌 정수 배열 speeds가 주어질 때 각 배포마다 몇 개의 기능이 배포되는지를 return 하도록 solution 함수를 완성하세요.

제한 사항
작업의 개수(progresses, speeds배열의 길이)는 100개 이하입니다.
작업 진도는 100 미만의 자연수입니다.
작업 속도는 100 이하의 자연수입니다.
배포는 하루에 한 번만 할 수 있으며, 하루의 끝에 이루어진다고 가정합니다. 예를 들어 진도율이 95%인 작업의 개발 속도가 하루에 4%라면 배포는 2일 뒤에 이루어집니다.
입출력 예
progresses	speeds	return
[93, 30, 55]	[1, 30, 5]	[2, 1]
[95, 90, 99, 99, 80, 99]	[1, 1, 1, 1, 1, 1]	[1, 3, 2]
입출력 예 설명
입출력 예 #1
첫 번째 기능은 93% 완료되어 있고 하루에 1%씩 작업이 가능하므로 7일간 작업 후 배포가 가능합니다.
두 번째 기능은 30%가 완료되어 있고 하루에 30%씩 작업이 가능하므로 3일간 작업 후 배포가 가능합니다. 하지만 이전 첫 번째 기능이 아직 완성된 상태가 아니기 때문에 첫 번째 기능이 배포되는 7일째 배포됩니다.
세 번째 기능은 55%가 완료되어 있고 하루에 5%씩 작업이 가능하므로 9일간 작업 후 배포가 가능합니다.

따라서 7일째에 2개의 기능, 9일째에 1개의 기능이 배포됩니다.

입출력 예 #2
모든 기능이 하루에 1%씩 작업이 가능하므로, 작업이 끝나기까지 남은 일수는 각각 5일, 10일, 1일, 1일, 20일, 1일입니다. 어떤 기능이 먼저 완성되었더라도 앞에 있는 모든 기능이 완성되지 않으면 배포가 불가능합니다.

따라서 5일째에 1개의 기능, 10일째에 3개의 기능, 20일째에 2개의 기능이 배포됩니다.

※ 공지 - 2020년 7월 14일 테스트케이스가 추가되었습니다.
'''

from collections import deque

# 작업이 완료되는 시간을 구하는 함수
def calDay(p,s):
    day_li =[]
    for i in range(len(p)):
        tmp = 100 - p[i]        # 100%에서 진도(%)만큼 빼준다
        if tmp % s[i] == 0:     # tmp를 속도로 나눠주어 며칠이 걸리는지 계산하는데, 나머지가 0이상일 경우 몫에 1을 더해준다
            d = tmp // s[i]
        else:
            d = (tmp // s[i]) + 1
        day_li.append(d)        # 구해진 일수를 리스트에 삽입해준다
    return day_li

# 각 배포마다 몇 개의 기능이 배포되는지 계산해주는 함수
def numFunction(li):
    queue = deque(li)           # li를 덱에 삽입해준다
    numfunc = []
    while queue:                # queue가 빌 때까지 반복해준다
        d = queue.popleft()     # 첫 element를 뽑아내고 cnt +1 한다
        cnt = 1
        while True:             # d보다 더 많이 걸린 날 직전까지 더해야하기 때문에 while문을 사용해준다
            if  len(queue) == 0 or (d < queue[0]):
                break
            if d >= queue[0]:   # 만약 다음번 작업이 직전의 작업보다 더 빠르게 완료되었다면 배포가 같이 이뤄질 수 있기 때문에 pop하여 제거함과 동시에 cnt +1 해준다
                queue.popleft()
                cnt += 1
        numfunc.append(cnt)
    return numfunc


def solution(progresses, speeds):
    days = calDay(progresses, speeds)
    answer = numFunction(days)
    return answer

# test case
# progresses = [93, 30, 55]	
# speeds = [1, 30, 5]	
# 정답  [2, 1]
progresses = [95, 90, 99, 99, 80, 99]	
speeds = [1, 1, 1, 1, 1, 1]	
# 정답  [1, 3, 2]

b = solution(progresses,speeds)
print(b)