'''
124 나라의 숫자
문제 설명
124 나라가 있습니다. 124 나라에서는 10진법이 아닌 다음과 같은 자신들만의 규칙으로 수를 표현합니다.

124 나라에는 자연수만 존재합니다.
124 나라에는 모든 수를 표현할 때 1, 2, 4만 사용합니다.
예를 들어서 124 나라에서 사용하는 숫자는 다음과 같이 변환됩니다.

10진법	124 나라	10진법	124 나라
1	1	6	14
2	2	7	21
3	4	8	22
4	11	9	24
5	12	10	41
자연수 n이 매개변수로 주어질 때, n을 124 나라에서 사용하는 숫자로 바꾼 값을 return 하도록 solution 함수를 완성해 주세요.

제한사항
n은 500,000,000이하의 자연수 입니다.
입출력 예
n	result
1	1
2	2
3	4
4	11
'''

def solution(n):
    answer = ''
    
    # 3으로 나눠서 몫과 나머지를 구분한다
    p = n // 3
    q = n % 3

    # 나머지가 0일 경우, 몫에서 1을 빼주고 나머지 값을 4로 저장한다
    if q == 0:
        p -= 1
        q = 4

    # 몫이 3이상인 경우, 재귀함수를 사용한다
    if p >= 3:
        tmp = solution(p)
        p = int(tmp)

    # 01은 의미가 없으므로 몫이 0을 초과하는 값에 한해서 몫의 문자열을 붙여준다
    if p > 0:
        answer += str(p) + str(q)
    else:
        answer += str(q)
    return answer